Core/src/Documents/ЗаказНаВозврат/ЗаказНаВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаВозврат</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ОПТИМУС_ТорговыеТочки</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВизита</name>
    <type>
      <types>DocumentRef.Визит</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/ЗаказНаВозврат/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗаказНаВозврат, СтруктураДополнительныеСвойства, ДокументОбъектЗаказНаВозврат) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаВозврат.Ссылка КАК Ссылка,
	|	ЗаказНаВозврат.Дата КАК Дата,
	|	ЗаказНаВозврат.Организация КАК Организация,
	|	ЗаказНаВозврат.Контрагент КАК Контрагент,
	|	ЗаказНаВозврат.Договор КАК Договор,
	|	ЗаказНаВозврат.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ЗаказНаВозврат.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ЗаказНаВозврат.ТорговаяТочка КАК ТорговаяТочка,
	|	ЗаказНаВозврат.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ втШапка
	|ИЗ
	|	Документ.ЗаказНаВозврат КАК ЗаказНаВозврат
	|ГДЕ
	|	ЗаказНаВозврат.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаВозвратЗапасы.Ссылка КАК Ссылка,
	|	втШапка.Дата КАК Дата,
	|	втШапка.Организация КАК Организация,
	|	втШапка.Контрагент КАК Контрагент,
	|	втШапка.Договор КАК Договор,
	|	ЗаказНаВозвратЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказНаВозвратЗапасы.Количество КАК Количество,
	|	ЗаказНаВозвратЗапасы.Сумма КАК Сумма
	|ПОМЕСТИТЬ втЗапасы
	|ИЗ
	|	Документ.ЗаказНаВозврат.Запасы КАК ЗаказНаВозвратЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втШапка КАК втШапка
	|		ПО ЗаказНаВозвратЗапасы.Ссылка = втШапка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетнаяПолитикаРеглСрезПоследних.КонтрольКоличестваПриВозврате КАК КонтрольКоличества,
	|	ДОБАВИТЬКДАТЕ(&ДатаДокумента, МЕСЯЦ, УчетнаяПолитикаРеглСрезПоследних.СрокКонтроляКоличестваПриВозврате) КАК ДатаКонтроляКоличества
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&ДатаДокумента, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних";
	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаказНаВозврат);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[МассивРезультатов.Количество()-1].Выбрать();
	Выборка.Следующий();
	
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("КонтрольКоличества", Выборка.КонтрольКоличества);
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ДатаКонтроляКоличества", Выборка.ДатаКонтроляКоличества);
	
	//--------------------------------------------------------------------------
	// © Шишка В.В. [3 октября 2023]  НАЧАЛО
	//СформироватьПроданныеИВозвращенныеТовары(ДокументСсылкаЗаказНаВозврат, СтруктураДополнительныеСвойства);
	СформироватьТаблицуЗаявкиНаВозврат(ДокументСсылкаЗаказНаВозврат, СтруктураДополнительныеСвойства);
	// © Шишка В.В. [3 октября 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	
КонецПроцедуры

//--------------------------------------------------------------------------
// © Шишка В.В. [3 октября 2023]  НАЧАЛО
Процедура СформироватьТаблицуЗаявкиНаВозврат(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	втЗапасы.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	втЗапасы.Организация КАК Организация,
	|	втЗапасы.Контрагент КАК Контрагент,
	|	втЗапасы.Договор КАК Договор,
	|	втЗапасы.Номенклатура КАК Номенклатура,
	|	СУММА(втЗапасы.Количество) КАК Количество
	|ИЗ
	|	втЗапасы КАК втЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗапасы.Дата,
	|	втЗапасы.Организация,
	|	втЗапасы.Контрагент,
	|	втЗапасы.Договор,
	|	втЗапасы.Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаявкиНаВозврат", РезультатЗапроса);
	
КонецПроцедуры// Олег Литвиненко <-
// © Шишка В.В. [3 октября 2023]  КОНЕЦ
//--------------------------------------------------------------------------


// Олег Литвиненко 05.10.22 --->
Процедура СформироватьПроданныеИВозвращенныеТовары(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	втЗапасы.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	втЗапасы.Организация КАК Организация,
	|	втЗапасы.Контрагент КАК Контрагент,
	|	втЗапасы.Договор КАК Договор,
	|	втЗапасы.Номенклатура КАК Номенклатура,
	|	втЗапасы.Количество КАК Количество
	|ИЗ
	|	втЗапасы КАК втЗапасы";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроданныеИВозвращенныеТовары", РезультатЗапроса);
	
КонецПроцедуры// Олег Литвиненко <-

Функция КонтрольКоличестваПриВозврате(Объект) Экспорт
	Результат = Новый Массив;
	
	//УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(Объект.Дата, Новый Структура("Организация", Объект.Организация));
	//Если УчетнаяПолитика.КонтрольКоличестваПриВозврате Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	МИНИМУМ(ЗаказНаВозвратЗапасы.НомерСтроки) КАК НомерСтроки,
	//	               |	ЗаказНаВозвратЗапасы.Ссылка.Контрагент КАК Контрагент,
	//	               |	ЗаказНаВозвратЗапасы.Ссылка.Договор КАК Договор,
	//	               |	ЗаказНаВозвратЗапасы.Номенклатура КАК Номенклатура,
	//	               |	СУММА(ЗаказНаВозвратЗапасы.Количество) КАК Количество,
	//	               |	ЗаказНаВозвратЗапасы.Цена КАК Цена,
	//	               |	СУММА(ЗаказНаВозвратЗапасы.Сумма) КАК Сумма
	//	               |ПОМЕСТИТЬ втЗапасы
	//	               |ИЗ
	//	               |	Документ.ЗаказНаВозврат.Запасы КАК ЗаказНаВозвратЗапасы
	//	               |ГДЕ
	//	               |	ЗаказНаВозвратЗапасы.Ссылка = &Ссылка
	//	               |
	//	               |СГРУППИРОВАТЬ ПО
	//	               |	ЗаказНаВозвратЗапасы.Номенклатура,
	//	               |	ЗаказНаВозвратЗапасы.Цена,
	//	               |	ЗаказНаВозвратЗапасы.Ссылка.Контрагент,
	//	               |	ЗаказНаВозвратЗапасы.Ссылка.Договор
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ
	//	               |	ЗаказНаВозвратЗапасы.НомерСтроки КАК НомерСтроки,
	//	               |	ЗаказНаВозвратЗапасы.Номенклатура КАК Номенклатура,
	//	               |	ЗаказНаВозвратЗапасы.Количество КАК Количество,
	//	               |	ЕСТЬNULL(ПроданныеИВозвращенныеТоварыОбороты.КоличествоОборот, 0) КАК КоличествоОборот
	//	               |ИЗ
	//	               |	втЗапасы КАК ЗаказНаВозвратЗапасы
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПроданныеИВозвращенныеТовары.Обороты(&ДатаНач, &ДатаКон, , Организация = &Организация) КАК ПроданныеИВозвращенныеТоварыОбороты
	//	               |		ПО ЗаказНаВозвратЗапасы.Контрагент = ПроданныеИВозвращенныеТоварыОбороты.Контрагент
	//	               |			И ЗаказНаВозвратЗапасы.Договор = ПроданныеИВозвращенныеТоварыОбороты.Договор
	//	               |			И ЗаказНаВозвратЗапасы.Номенклатура = ПроданныеИВозвращенныеТоварыОбороты.Номенклатура
	//	               |ГДЕ
	//	               |	ЗаказНаВозвратЗапасы.Количество > ЕСТЬNULL(ПроданныеИВозвращенныеТоварыОбороты.КоличествоОборот, 0)";
	//	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//	Запрос.УстановитьПараметр("ДатаКон", Новый Граница(Новый МоментВремени(Объект.Дата, Объект.Ссылка), ВидГраницы.Исключая));
	//	Запрос.УстановитьПараметр("ДатаНач", ДобавитьМесяц(НачалоДня(Объект.Дата), -УчетнаяПолитика.СрокКонтроляКоличестваПриВозврате));
	//	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//	
	//	ТаблицаОшибок = Запрос.Выполнить().Выгрузить();
	//	Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаОшибок);
	//КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура ВывестиОшибкиКонтроляКоличестваПриВозврате(СписокСтрок) Экспорт
	Перем Ошибки;
	
	Если СписокСтрок.Количество() Тогда
		
		Отказ = Истина;
		
		Для Каждого ТекСтр Из СписокСтрок Цикл
			
			ТекстОднойОшибки = ?(СписокСтрок.Количество()=1, 
				СтрШаблон("Возвращено больше, чем продано. Продано %1", ТекСтр.КоличествоОборот), 
				СтрШаблон("Продано %1",ТекСтр.КоличествоОборот));
				
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Запасы[%1].Количество", 
				ТекстОднойОшибки, "Количество", ТекСтр.НомерСтроки-1, "Возвращено больше, чем продано");
			КонецЦикла;
			
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);	
		
	КонецЕсли;
	
КонецПроцедуры
